  
/*
 *   split() : => String[] 
 *   문자를 구분해서 자르는 역할 
 *   
 *   "밑반찬",메인반찬,국/탕,찌개,디저트,면/만두밥,죽/떡퓨,전,김치/젓갈,장류,양념,소스/잼,양식,샐러드,스프,빵,과자,차/음료,
 *   술,기타
 *   
 *   결백(2019)|상영중|07 . 8|드라마|한국|2020.06.10|110분|15세이상관람가|박상현 주연 신혜선, 배종옥, 허준호\n
     /^([a-z0-9_\.-]+)@([\da-z\.-]+)\.([a-z\.]{2,6})$/
      * 
     [0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}
     
         맛있[가-R]+
         
         짜[가-R]+
 */
public class 문자열5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        String msg="밑반찬?메인반찬?국/탕?찌개?디저트?면/만두밥?죽/떡퓨?전?김치/젓갈?장류?양념?소스/잼?양식?샐러드?스프?빵?과자?차/음료?" 
		          +"술?기타";
        String[] arr=msg.split("\\?"); // 일반문자열 => 배열로 변경
        //msg.sp => regex
        // 문자일때만 사용이 가능 
        for(String s:arr)
        {
        	System.out.println(s);
        }
	}

}